import { Question } from "./types"; 

export const questions: Question[] = [
  {
    id: 1,
    text: "Укажите единицу измерения атмосферного давления.",
    varaints: ["Ньютон", "Паскаль", "Ампер"],
    answer: "Паскаль"
  },
  {
    id: 2,
    text: "Самая жаркая планета, которая находится ближе всего по отношению к Солнцу.",
    varaints: ["Марс", "Венера", "Меркурий"],
    answer: "Венера"
  },
  {
    id: 3,
    text: "Что делает биссектриса треугольника?",
    varaints: ["Делит угол, из которого она выходит на две равные части", "Делит противоположную сторону на два равных отрезка", "Делит треугольник на две фигуры с одинаковой площадью"],
    answer: "Делит угол, из которого она выходит на две равные части"
  },
  {
    id: 4,
    text: "Кто автор строк: «Отговорила роща золотая березовым, веселым языком, и журавли, печально пролетая, уж не жалеют больше ни о ком.»?",
    varaints: ["Сергей Есенин", "Александр Блок", "Александр Пушкин"],
    answer: "Сергей Есенин"
  },
  {
    id: 5,
    text: "Сколько пар хромосом включает геном человека?",
    varaints: ["23 пары", "22 пары", "24 пары"],
    answer: "23 пары"
  },
  {
    id: 6,
    text: "Мужской репродуктивный орган цветковых растений, в котором образуется пыльца, называется ...",
    varaints: ["Пестик", "Тычинка", "Чашелистик"],
    answer: "Тычинка"
  },
  {
    id: 7,
    text: "Какие океаны омывают побережье Африки?",
    varaints: ["Атлантический, Индийский", "Тихий, Индийский", "Тихий, Атлантический"],
    answer: "Атлантический, Индийский"
  },
  {
    id: 8,
    text: "Как называется стадия эмбрионального развития, в процессе которой образуются зародышевые листки?",
    varaints: ["Зигота", "Гаструла", "Бластула"],
    answer: "Бластула"
  },
  {
    id: 9,
    text: "Выберете правильную химическую формулу пищевой соды.",
    varaints: ["NaHCO3", "NaCl", "CaOH"],
    answer: "NaHCO3"
  },
  {
    id: 10,
    text: "Кто из ученых проводил первые опыты по изучению процесса фотосинтеза?",
    varaints: ["Вильгельм Пфеффер", "Роберт Майер", "Джозеф Пристли"],
    answer: "Джозеф Пристли"
  },
  {
    id: 11,
    text: "Кто возглавил восстание декабристов, которое состоялось в Санкт-Петербурге в 1825 году?",
    varaints: ["Сергей Трубецкой", "Михаил Сперанский", "Павел Пестель"],
    answer: "Сергей Трубецкой"
  },
  {
    id: 12,
    text: "Ноты размещаются на нотном стане, который также называется нотоносец. Сколько линий входит в его состав?",
    varaints: ["5", "6", "4"],
    answer: "5"
  },
  {
    id: 13,
    text: "Чем отличаются крокодилы от аллигаторов?",
    varaints: ["Формой морды: у крокодила она длинная и узкая, а у аллигатора широкая и сплющенная", "Размерами: аллигаторы в длину достигают до 3 метров, крокодилы - до 5 метров", "У аллигаторов видны зубы, если сомкнута челюсть"],
    answer: "Формой морды: у крокодила она длинная и узкая, а у аллигатора широкая и сплющенная"
  },
  {
    id: 14,
    text: "Какие члены предложения могут обособляться и при этом выделяются интонацией и запятыми?",
    varaints: ["Определение", "Дополнение", "Обстоятельство"],
    answer: "Определение"
  },
  {
    id: 15,
    text: "Какой химический элемент входит в состав отбеливающих средств, которые используются для стирки белья?",
    varaints: ["Фтор", "Хлор", "Кальций"],
    answer: "Хлор"
  },
  {
    id: 16,
    text: "Самая высокая точка Северной Америки расположена на территории Аляски. Она называется ...",
    varaints: ["Монблан", "Денали", "Эльбрус"],
    answer: "Денали"
  },
  {
    id: 17,
    text: "В 1943 году состоялось масштабное танковое сражение Второй мировой войны, которое получило название ...",
    varaints: ["Сталинградская битва", "Сражение под Прохоровкой", "Смоленское сражение"],
    answer: "Сражение под Прохоровкой"
  },
  {
    id: 18,
    text: "К какому классу принадлежит аксолотль?",
    varaints: ["Земноводные", "Рептилии", "Рыбы"],
    answer: "Земноводные"
  },
  {
    id: 19,
    text: "Как называется стиль живописи, который позволяет художнику выразить своё субъективное восприятие действительности?",
    varaints: ["Импрессионизм", "Экспрессионизм", "Авангардизм"],
    answer: "Экспрессионизм"
  },
  {
    id: 20,
    text: "Что выражает литературный приём метафора?",
    varaints: ["Дарит слову, к которому относится, особую эмоциональную окраску", "Наделяет предметы чертами живых существ", "Переносит свойства с одного предмета на другой"],
    answer: "Переносит свойства с одного предмета на другой"
  },
];
